code-review/NRB_3471_3546/База_Стало/DataProcessors/СозданиеПорученийНаПереводЦБПоДаннымKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СозданиеПорученийНаПереводЦБПоДаннымKafka</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПоручений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоручений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/СозданиеПорученийНаПереводЦБПоДаннымKafka/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура исполняет поручения на перевод ЦБ за предыдущий день
//
Процедура ИсполнитьПорученияНаПереводЦБЗаПредыдущийДень() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КонецПредыдущегоДня = НачалоДня(ТекущаяДатаСеанса()) - 1;
	Запрос.УстановитьПараметр("ВидИнициатораБрокер", 1);
	Запрос.УстановитьПараметр("КонецПредыдущегоДня", КонецПредыдущегоДня);
	Запрос.УстановитьПараметр("КонецПредыдущегоДняГраница", Новый Граница(КонецПредыдущегоДня));
	Запрос.УстановитьПараметр("НачалоПредыдущегоДня", НачалоДня(КонецПредыдущегоДня));
	
	Запрос.Текст = ТекстЗапросаДанныеПоПоручениям();
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиЦБ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СчетДепо", "СчетДепо");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РазделСчетаДепо", "РазделСчетаДепо");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЦБ", "ЦБ");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СчетДепоМХ", "СчетДепоМХ");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РазделСчетаДепоМХ", "РазделСчетаДепоМХ");
		Блокировка.Заблокировать();
		
		Запрос.Текст = ТекстЗапросаОстаткиЦБ();
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоЦБ > Выборка.КоличествоОстаток Тогда
				ОтправитьУведомлениеОНедостаточномОстаткеДляПереводаЦБ(Выборка);
			Иначе
				ДатаИсполнения = НачалоДня(ТекущаяДатаСеанса()) - ОбщегоНазначенияПовтИсп.СекундВСутках();
				
				ОперацияЦБОбъект = Выборка.ОперацияЦБ.ПолучитьОбъект();
				ОперацияЦБОбъект.Дата = КонецДня(ДатаИсполнения);
				ОперацияЦБОбъект.ДатаИсполненияВДепозитарииМХ = ДатаИсполнения;
				ОперацияЦБОбъект.ДатаИсполненияВМестеРасчетов = ДатаИсполнения;
				ОперацияЦБОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации("ИсполнениеПорученийНаПереводЦБ", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеПоПоручениям()
	
	Возврат
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Поручение,
	|	ДокументПоручение.ТипПеревода КАК ТипПеревода,
	|	ДокументПоручение.СчетДепо КАК СчетДепо,
	|	ДокументПоручение.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДокументПоручение.ЦБ КАК ЦБ,
	|	ДокументПоручение.СчетДепоМХ КАК СчетДепоМХ,
	|	ДокументПоручение.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ДокументПоручение.КоличествоЦБ КАК КоличествоЦБ
	|ПОМЕСТИТЬ Поручения
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ОрганизацияПоУмолчанию КАК ОрганизацияПоУмолчанию
	|		ПО ДокументПоручение.Инициатор = ОрганизацияПоУмолчанию.Значение
	|ГДЕ
	|	ДокументПоручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|	И ДокументПоручение.ТипПеревода В (ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Списание), ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Зачисление))
	|	И ДокументПоручение.ВидИнициатора = &ВидИнициатораБрокер
	|	И ДокументПоручение.ПланируемаяДатаРасчетов МЕЖДУ &НачалоПредыдущегоДня И &КонецПредыдущегоДня
	|	И ДокументПоручение.СчетДепоМХ = ДокументПоручение.СчетДепоМХКонтрагента
	|	И ДокументПоручение.РазделСчетаДепоМХ = ДокументПоручение.РазделСчетаДепоМХКонтрагента
	|	И ДокументПоручение.НомерПорученияВБО ПОДОБНО ""OTC_%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыПорученийСрезПоследних.Поручение КАК Поручение,
	|	СтатусыПорученийСрезПоследних.СтатусПоручения КАК СтатусПоручения
	|ПОМЕСТИТЬ СтатусыПоручений
	|ИЗ
	|	РегистрСведений.СтатусыПоручений.СрезПоследних(
	|			&КонецПредыдущегоДняГраница,
	|			Поручение В
	|				(ВЫБРАТЬ
	|					Поручения.Поручение КАК Поручение
	|				ИЗ
	|					Поручения КАК Поручения)) КАК СтатусыПорученийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поручения.Поручение КАК Поручение,
	|	Поручения.ТипПеревода КАК ТипПеревода
	|ПОМЕСТИТЬ ПорученияВСтатусеОбрабатывается
	|ИЗ
	|	Поручения КАК Поручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыПоручений КАК СтатусыПоручений
	|		ПО (СтатусыПоручений.Поручение = Поручения.Поручение)
	|			И (СтатусыПоручений.СтатусПоручения = ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Обрабатывается))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка КАК ОперацияЦБ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПорученияВСтатусеОбрабатывается.ТипПеревода = ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Списание)
	|				ТОГДА ПорученияВСтатусеОбрабатывается.Поручение
	|		КОНЕЦ) КАК ПоручениеСписание,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПорученияВСтатусеОбрабатывается.ТипПеревода = ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Зачисление)
	|				ТОГДА ПорученияВСтатусеОбрабатывается.Поручение
	|		КОНЕЦ) КАК ПоручениеЗачисление
	|ПОМЕСТИТЬ ОперацияИПоручения
	|ИЗ
	|	ПорученияВСтатусеОбрабатывается КАК ПорученияВСтатусеОбрабатывается
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ПО (ВЫБОР
	|				КОГДА ПорученияВСтатусеОбрабатывается.Поручение = ОперацииЦБ.ДокументОснование
	|					ТОГДА ИСТИНА
	|				КОГДА ПорученияВСтатусеОбрабатывается.Поручение = ОперацииЦБ.ДокументОснованиеВстречный
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииЦБ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияИПоручения.ОперацияЦБ КАК ОперацияЦБ,
	|	ОперацияИПоручения.ПоручениеСписание КАК ПоручениеСписание,
	|	ОперацияИПоручения.ПоручениеЗачисление КАК ПоручениеЗачисление,
	|	Поручения.КоличествоЦБ КАК КоличествоЦБ,
	|	Поручения.СчетДепо КАК СчетДепо,
	|	Поручения.РазделСчетаДепо КАК РазделСчетаДепо,
	|	Поручения.ЦБ КАК ЦБ,
	|	Поручения.СчетДепоМХ КАК СчетДепоМХ,
	|	Поручения.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ОперацияИПоручения КАК ОперацияИПоручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Поручения КАК Поручения
	|		ПО ОперацияИПоручения.ПоручениеСписание = Поручения.Поручение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИтоговыеДанные.СчетДепо КАК СчетДепо,
	|	ИтоговыеДанные.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ИтоговыеДанные.ЦБ КАК ЦБ,
	|	ИтоговыеДанные.СчетДепоМХ КАК СчетДепоМХ,
	|	ИтоговыеДанные.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные";
	
КонецФункции

Функция ТекстЗапросаОстаткиЦБ()
	
	Возврат
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&КонецПредыдущегоДняГраница,
	|			(СчетДепо, РазделСчетаДепо, ЦБ, СчетДепоМХ, РазделСчетаДепоМХ) В
	|				(ВЫБРАТЬ
	|					ИтоговыеДанные.СчетДепо КАК СчетДепо,
	|					ИтоговыеДанные.РазделСчетаДепо КАК РазделСчетаДепо,
	|					ИтоговыеДанные.ЦБ КАК ЦБ,
	|					ИтоговыеДанные.СчетДепоМХ КАК СчетДепоМХ,
	|					ИтоговыеДанные.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	|				ИЗ
	|					ИтоговыеДанные КАК ИтоговыеДанные)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.ОперацияЦБ КАК ОперацияЦБ,
	|	ИтоговыеДанные.КоличествоЦБ КАК КоличествоЦБ,
	|	ИтоговыеДанные.ЦБ.ISIN КАК ISIN,
	|	ИтоговыеДанные.ПоручениеСписание КАК ПоручениеСписание,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИтоговыеДанные.СчетДепо) КАК СчетДепо,
	|	ЕСТЬNULL(ОстаткиЦБ.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЦБ КАК ОстаткиЦБ
	|		ПО ИтоговыеДанные.СчетДепо = ОстаткиЦБ.СчетДепо
	|			И ИтоговыеДанные.РазделСчетаДепо = ОстаткиЦБ.РазделСчетаДепо
	|			И ИтоговыеДанные.ЦБ = ОстаткиЦБ.ЦБ
	|			И ИтоговыеДанные.СчетДепоМХ = ОстаткиЦБ.СчетДепоМХ
	|			И ИтоговыеДанные.РазделСчетаДепоМХ = ОстаткиЦБ.РазделСчетаДепоМХ";
	
КонецФункции

// Процедура отправляет уведомление о недостаточном остатке для перевода ЦБ
//
// Параметры:
//  ПараметрыСообщения - Строка - Параметры для текста сообщения
//
Процедура ОтправитьУведомлениеОНедостаточномОстаткеДляПереводаЦБ(ПараметрыСообщения)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНедостаточномОстаткеДляПереводаЦБ;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Поручение на перевод ЦБ. ОТС. Недостаточно ЦБ";
	
	КоличествоЦБ 		= Формат(ПараметрыСообщения.КоличествоЦБ, "ЧГ=");
	СсылкаНаПоручение 	= ПолучитьНавигационнуюСсылку(ПараметрыСообщения.ПоручениеСписание);
	СчетДепо 			= СокрЛП(ПараметрыСообщения.СчетДепо);
	
	ТекстУведомления = ("Счет Депо: " + СчетДепо + Символы.ВК
		+ "ISIN: " + ПараметрыСообщения.ISIN + Символы.ВК
		+ "Количество ЦБ: " + КоличествоЦБ + Символы.ВК
		+ "Ссылка на поручение: " + СсылкаНаПоручение + ".");
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
	
КонецПроцедуры

#КонецОбласти
